Autodesk.Revit.DB.ConnectorType
An enumerated type listing all connector types for a connection

Autodesk.Revit.DB.ConnectorType.AllModes
All connection modes

Autodesk.Revit.DB.ConnectorType.Super
Connection between a sub-system and a super-system, such as a connection between supply and return
sub-systems and a main hydronic piping system or an air system.

Autodesk.Revit.DB.ConnectorType.AnyEnd
Any end connection type

Autodesk.Revit.DB.ConnectorType.NonEnd
Not end connection type

Autodesk.Revit.DB.ConnectorType.Physical
Physical connection type

Autodesk.Revit.DB.ConnectorType.Family
Family connection type

Autodesk.Revit.DB.ConnectorType.EndSurface
End or Surface connection type

Autodesk.Revit.DB.ConnectorType.BlankEnd
Blank End type

Autodesk.Revit.DB.ConnectorType.NodeReference
Reference to the layout node type

Autodesk.Revit.DB.ConnectorType.MasterSurface
Master surface connection type

Autodesk.Revit.DB.ConnectorType.Surface
Surface connection type

Autodesk.Revit.DB.ConnectorType.Reference
Reference connection type

Autodesk.Revit.DB.ConnectorType.Logical
Logical connection type

Autodesk.Revit.DB.ConnectorType.Curve
Curve connection type

Autodesk.Revit.DB.ConnectorType.End
End connection type

Autodesk.Revit.DB.ConnectorType.Invalid
Invalid connection type